app/views/entries/_form.html.erb

		<%= f.label :category_id %><br />
		<%= select("entry","category_id", @categories.collect {|p| [ p.name, p.id ]},{:include_blank => 'Category'}) %>
---
SELECT "categories".* FROM "categories" WHERE (user_id = 1)