app/views/entries/index.html.erb

    <td><%= entry.amount %></td>
    <td><%= User.find(entry.user_id).email %></td>
    <td><%= Category.find(entry.category_id).name %></td>
    <td><%= Type.find(entry.type_id).name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", 4]]