app/controllers/categories_controller.rb

  def index

    @categories = Category.where("user_id = #{current_user.id}").all
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1 LIMIT 1

  def show
    @category = Category.where("user_id = #{current_user.id}").find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? AND (user_id = 1) LIMIT 1  [["id", "4"]]

  def edit
    #where("user_id = #{current_user.id}")

  #  @prueba = Category.category_user(params[:id])
  #  if Category.category_user(params[:id])
     # @category = Category.where("user_id = #{current_user.id}").find(params[:id])
   # else
    #  redirect_to categories_path
    #end

     @category = Category.where("user_id = #{current_user.id}").find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? AND (user_id = 1) LIMIT 1  [["id", "8"]]

  def create
    params[:category][:user_id] = current_user.id

    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 23 Apr 2012 19:00:47 UTC +00:00], ["name", "prueba"], ["updated_at", Mon, 23 Apr 2012 19:00:47 UTC +00:00], ["user_id", 1]]

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "categories" SET "name" = 'Leisure', "updated_at" = '2012-04-23 18:54:24.722857' WHERE "categories"."id" = 4