app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index

    @categories = Category.where("user_id = #{current_user.id}").all

    if @categories.length != 0