app/controllers/entries_controller.rb

  def new
    @entry = Entry.new

    @categories = Category.all
    @types = Type.all
---
SELECT "categories".* FROM "categories"
SELECT "types".* FROM "types"

  def edit

    @entry = Entry.find(params[:id])
    @categories = Category.all
    @types = Type.all
---
SELECT "categories".* FROM "categories"
SELECT "types".* FROM "types"