app/controllers/entries_controller.rb

  def index

    if !current_user.blank?
      @entries = Entry.where("user_id = #{current_user.id}").all
    else
      @entries = Entry.all
    end

    # added
    @categories = Category.all
    @types = Type.all
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 2 LIMIT 1
SELECT "entries".* FROM "entries"
SELECT "categories".* FROM "categories"
SELECT "types".* FROM "types"

  def show
    @entry = Entry.find(params[:id])

    # adding additionals fields
    @category_name = Category.find(@entry.category_id).name
    @type_name = Type.find(@entry.type_id).name
    @user_name = User.find(@entry.user_id).email
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @entry = Entry.new

    @categories = Category.where("user_id = #{current_user.id}").all
    @types = Type.where("user_id = #{current_user.id}").all
---
SELECT "categories".* FROM "categories" WHERE (user_id = 1)
SELECT "types".* FROM "types" WHERE (user_id = 1)

  def edit


#@entry = Entry.exists?(:user_id => current_user.id) ? Entry.where("user_id = #{current_user.id}").find(params[:id]) : nil

    #if Entry.where("user_id = #{current_user.id}").find(params[:id]).count == 0
    #  redirect_to "http://www.google.com"

    #else
      #@entry = Entry.find(params[:id])
      #@categories = Category.all
      @entry = Entry.where("user_id = #{current_user.id}").find(params[:id])
      #@types = Type.where("user_id = #{current_user.id}").find(params[:id])
      #@types = Type.all
      @categories = Category.where("user_id = #{current_user.id}").all
      @types = Type.where("user_id = #{current_user.id}").all
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? AND (user_id = 1) LIMIT 1  [["id", "2"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? AND (user_id = 1) LIMIT 1  [["id", "2"]]
SELECT "types".* FROM "types" WHERE "types"."id" = ? AND (user_id = 1) LIMIT 1  [["id", "2"]]

  def create
    # assings a user_id with logged id user
    params[:entry][:user_id] = current_user.id

    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("amount", "category_id", "concept", "created_at", "id", "type_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "entries" SET "concept" = 'sell macbook pro', "amount" = 2000.0, "category_id" = 2, "type_id" = 1, "updated_at" = '2012-05-02 14:29:39.380933' WHERE "entries"."id" = 5

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 5]]