app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE (user_id = 1)
SELECT "expenses".* FROM "expenses"
SELECT "categories".* FROM "categories"
---
  def index

    if !current_user.blank?
      @expenses = Expense.where("user_id = #{current_user.id}").all
    else
      @expenses = Expense.all
    end

    # added
    @categories = Category.all

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @expense = Expense.find(params[:id])

    # adding additionals fields
    @category_name = Category.find(@expense.category_id).name
    # @type_name = Type.find(@expense.type_id).name
    @user_name = User.find(@expense.user_id).email

SELECT "categories".* FROM "categories" WHERE (user_id = 1)
---
  def new
    @expense = Expense.new

    @categories = Category.where("user_id = #{current_user.id}").all

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @expense = Expense.where("user_id = #{current_user.id}").find(params[:id])

INSERT INTO "expenses" ("amount", "category_id", "concept", "created_at", "type_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create

    params[:expense][:user_id] = current_user.id

    @expense = Expense.new(params[:expense])
    respond_to do |format|
      if @expense.save