app/controllers/expenses_controller.rb

  def index

    @expenses = Expense.where("user_id = #{current_user.id}").all

    # added
    @categories = Category.where("user_id = #{current_user.id}").all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 4 LIMIT 1