app/controllers/types_controller.rb

  def index
    @types = Type.where("user_id = #{current_user.id}").all
---
SELECT "types".* FROM "types" WHERE (user_id = 1)

  def show
    @type = Type.where("user_id = #{current_user.id}").find(params[:id])
---
SELECT "types".* FROM "types" WHERE "types"."id" = ? AND (user_id = 1) LIMIT 1  [["id", "6"]]

  def edit
    @type = Type.find(params[:id])
---
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", "7"]]

  def create
    params[:type][:user_id] = current_user.id
    @type = Type.new(params[:type])

    respond_to do |format|
      if @type.save
---
INSERT INTO "types" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 23 Apr 2012 19:23:25 UTC +00:00], ["name", "unica"], ["updated_at", Mon, 23 Apr 2012 19:23:25 UTC +00:00], ["user_id", 1]]

  def update
    @type = Type.find(params[:id])

    respond_to do |format|
      if @type.update_attributes(params[:type])
---
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "types" SET "name" = 'mensual jose', "updated_at" = '2012-04-23 19:25:42.220699' WHERE "types"."id" = 7

  def destroy
    @type = Type.find(params[:id])
    @type.destroy
---
SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "types" WHERE "types"."id" = ?  [["id", 7]]