app/views/expenses/index.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 4 LIMIT 1
SELECT "types".* FROM "types" WHERE "types"."id" = 6 LIMIT 1
---
    <td><%= expense.amount %></td>
    <td><%= Category.find(expense.category_id).name %></td>
    <td><%= Type.find(expense.type_id).name %></td>